  const categories = {
    "종류별": [
      { name: "전체", code: "100" },
      { name: "밑반찬", code: "101" },
      { name: "메인반찬", code: "102" },
      { name: "국/탕", code: "103" },
      // ... 생략 ...
    ],
    "상황별": [
      { name: "전체", code: "200" },
      { name: "일상", code: "201" },
      // ...
    ],
    "재료별": [
      { name: "전체", code: "300" },
      { name: "소고기", code: "301" },
      // ...
    ],
    "방법별": [
      { name: "전체", code: "400" },
      { name: "볶음", code: "401" },
      // ...
    ],
    "테마별": [
	      { name: "여성/뷰티", code: "411" },
	      { name: "엄마/아기", code: "421" },
	      // ...
	]
  };
